
## :x: Apply Failed

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/7688598759)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-lambda-layer/runs/run-tdZmJGDAn7BD1LH5

Waiting for 1 run(s) to finish before being queued...
Waiting for 1 run(s) to finish before being queued... (30s elapsed)
Waiting for 1 run(s) to finish before being queued... (1m0s elapsed)
Waiting for 1 run(s) to finish before being queued... (1m30s elapsed)
Waiting for 1 run(s) to finish before being queued... (2m0s elapsed)
Waiting for 1 run(s) to finish before being queued... (2m30s elapsed)

Terraform v1.5.4
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=b464fb8901f09f6f02604a785b169e329ec86e39]
data.aws_caller_identity.current: Reading...
data.aws_iam_role.role: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.test will be created
  + resource "aws_api_gateway_deployment" "test" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "mtchoun-mouh-lambda-layer-dev"
    }

  # aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.method will be created
  + resource "aws_api_gateway_method" "method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_method_response.method_response_200 will be created
  + resource "aws_api_gateway_method_response" "method_response_200" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = false
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # aws_api_gateway_resource.resource will be created
  + resource "aws_api_gateway_resource" "resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "register"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Allow to register user for sending notifications later"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "mtchoun-mouh-lambda-layer-user registration"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags                         = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                     = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_cloudwatch_event_rule.scheduler will be created
  + resource "aws_cloudwatch_event_rule" "scheduler" {
      + arn                 = (known after apply)
      + description         = "extract image - verify passport is out - send notifications"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "mtchoun-mouh-lambda-layer-trigger_user_scan"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 8 ? * MON-FRI *)"
      + tags                = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all            = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
    }

  # aws_cloudwatch_event_target.target will be created
  + resource "aws_cloudwatch_event_target" "target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "mtchoun-mouh-lambda-layer-trigger_user_scan"
      + target_id      = "lambda"
    }

  # aws_dynamodb_table.Link_table will be created
  + resource "aws_dynamodb_table" "Link_table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "link"
      + id               = (known after apply)
      + name             = "mtchoun-mouh-lambda-layer-Link_table"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all         = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + write_capacity   = 1

      + attribute {
          + name = "link"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }
    }

  # aws_dynamodb_table.Register will be created
  + resource "aws_dynamodb_table" "Register" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "Name"
      + id               = (known after apply)
      + name             = "mtchoun-mouh-lambda-layer-Register"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all         = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + write_capacity   = 1

      + attribute {
          + name = "Name"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }
    }

  # aws_dynamodb_table.Users will be created
  + resource "aws_dynamodb_table" "Users" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "UserName"
      + id               = (known after apply)
      + name             = "mtchoun-mouh-lambda-layer-Users"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all         = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + write_capacity   = 1

      + attribute {
          + name = "UserName"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }
    }

  # aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + arn                            = (known after apply)
      + filename                       = "api/lambda.zip"
      + function_name                  = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      + handler                        = "lambda.register_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::053932140667:role/website-deployer"
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "sdXkkIUn6SqwHkfapeP2yXoDz63SXDjjp7umyRdXzaU="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                       = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_KEY"         = (sensitive value)
              + "BUCKET_NAME"     = "mtchoun-mouh-lambda-layer-djansang"
              + "ENV"             = "mtchoun-mouh-lambda-layer"
              + "LINKS_TABLE"     = "mtchoun-mouh-lambda-layer-Link_table"
              + "MAINTAINER_MAIL" = (sensitive value)
              + "REGION"          = "eu-central-1"
              + "REGISTERS_TABLE" = "mtchoun-mouh-lambda-layer-Register"
              + "SENTRY_DNS"      = (sensitive value)
              + "USERS_TABLE"     = "mtchoun-mouh-lambda-layer-Users"
            }
        }
    }

  # aws_lambda_function.scan will be created
  + resource "aws_lambda_function" "scan" {
      + arn                            = (known after apply)
      + filename                       = "api/lambda.zip"
      + function_name                  = "mtchoun-mouh-lambda-layer-scan_user_consulcam"
      + handler                        = "lambda.scan_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::053932140667:role/website-deployer"
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "sdXkkIUn6SqwHkfapeP2yXoDz63SXDjjp7umyRdXzaU="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                       = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_KEY"         = (sensitive value)
              + "BUCKET_NAME"     = "mtchoun-mouh-lambda-layer-djansang"
              + "ENV"             = "mtchoun-mouh-lambda-layer"
              + "LINKS_TABLE"     = "mtchoun-mouh-lambda-layer-Link_table"
              + "MAINTAINER_MAIL" = (sensitive value)
              + "REGION"          = "eu-central-1"
              + "REGISTERS_TABLE" = "mtchoun-mouh-lambda-layer-Register"
              + "SENTRY_DNS"      = (sensitive value)
              + "USERS_TABLE"     = "mtchoun-mouh-lambda-layer-Users"
            }
        }
    }

  # aws_lambda_layer_version.test_lambda_layer will be created
  + resource "aws_lambda_layer_version" "test_lambda_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.7",
          + "python3.8",
        ]
      + created_date                = (known after apply)
      + filename                    = "python.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "test_lambda_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_permission.allow_cloudwatch_to_call_check_foo will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_call_check_foo" {
      + action        = "lambda:InvokeFunction"
      + function_name = "mtchoun-mouh-lambda-layer-scan_user_consulcam"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # aws_s3_bucket.images will be created
  + resource "aws_s3_bucket" "images" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "mtchoun-mouh-lambda-layer-djansang"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"        = "images"
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                    = {
          + "Name"        = "images"
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.website will be created
  + resource "aws_s3_bucket" "website" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"        = "Website"
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                    = {
          + "Name"        = "Website"
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "PUT",
              + "POST",
              + "GET",
            ]
          + allowed_origins = [
              + "*",
            ]
        }

      + website {
          + error_document = "error.html"
          + index_document = "index.html"
        }
    }

  # aws_s3_bucket_object.example_file will be created
  + resource "aws_s3_bucket_object" "example_file" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../html/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_policy.website will be created
  + resource "aws_s3_bucket_policy" "website" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.website will be created
  + resource "aws_s3_bucket_public_access_block" "website" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + co

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

 (local-exec): 2024-01-28 21:51:29 .....            0            0  python/lib/python3.8/site-packages/wheel/vendored/packaging/__init__.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:33 D....            0            0  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:33 .....          242          190  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/__init__.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:33 .....         3412         1896  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/_elffile.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:33 .....         6438         3482  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/_manylinux.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:33 .....         3384         1973  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/_musllinux.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:33 .....         8997         3949  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/_parser.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:33 .....         2852          885  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/_structures.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:33 .....         5780         3082  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/_tokenizer.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:33 .....         7057         3530  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/markers.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:33 .....         2894         1559  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/requirements.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:33 .....        30389         9288  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/specifiers.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:33 .....        13385         6516  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/tags.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:33 .....         4656         2489  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/utils.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:33 .....        14383         5087  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/version.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....         3266         1237  python/lib/python3.8/site-packages/wheel/vendored/packaging/_elffile.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....         9526         3322  python/lib/python3.8/site-packages/wheel/vendored/packaging/_manylinux.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....         2676         1197  python/lib/python3.8/site-packages/wheel/vendored/packaging/_musllinux.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....        10382         2383  python/lib/python3.8/site-packages/wheel/vendored/packaging/_parser.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....         1431          351  python/lib/python3.8/site-packages/wheel/vendored/packaging/_structures.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....         5292         1801  python/lib/python3.8/site-packages/wheel/vendored/packaging/_tokenizer.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....         8208         2686  python/lib/python3.8/site-packages/wheel/vendored/packaging/markers.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....         2952         1055  python/lib/python3.8/site-packages/wheel/vendored/packaging/requirements.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....        39206         8221  python/lib/python3.8/site-packages/wheel/vendored/packaging/specifiers.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....        18355         5197  python/lib/python3.8/site-packages/wheel/vendored/packaging/tags.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....         5268         1738  python/lib/python3.8/site-packages/wheel/vendored/packaging/utils.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....        16236         4223  python/lib/python3.8/site-packages/wheel/vendored/packaging/version.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....           16           16  python/lib/python3.8/site-packages/wheel/vendored/vendor.txt
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....         7701         2485  python/lib/python3.8/site-packages/wheel/wheelfile.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 D....            0            0  python/lib/python3.8/site-packages/wheel-0.42.0.dist-info
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....            4            4  python/lib/python3.8/site-packages/wheel-0.42.0.dist-info/INSTALLER
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....         1107          655  python/lib/python3.8/site-packages/wheel-0.42.0.dist-info/LICENSE.txt
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....         2203          964  python/lib/python3.8/site-packages/wheel-0.42.0.dist-info/METADATA
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....         4201         1714  python/lib/python3.8/site-packages/wheel-0.42.0.dist-info/RECORD
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....           81           81  python/lib/python3.8/site-packages/wheel-0.42.0.dist-info/WHEEL
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....          104           74  python/lib/python3.8/site-packages/wheel-0.42.0.dist-info/entry_points.txt
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:29 .....            0            0  python/lib/python3.8/site-packages/wheel-0.42.0.virtualenv
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 D....            0            0  python/lib/python3.8/site-packages/yaml
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....        12012         2295  python/lib/python3.8/site-packages/yaml/__init__.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 D....            0            0  python/lib/python3.8/site-packages/yaml/__pycache__
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....        11431         3877  python/lib/python3.8/site-packages/yaml/__pycache__/__init__.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         3572         1644  python/lib/python3.8/site-packages/yaml/__pycache__/composer.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....        19634         7316  python/lib/python3.8/site-packages/yaml/__pycache__/constructor.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         3415         1088  python/lib/python3.8/site-packages/yaml/__pycache__/cyaml.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         1832          740  python/lib/python3.8/site-packages/yaml/__pycache__/dumper.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....        25362        10024  python/lib/python3.8/site-packages/yaml/__pycache__/emitter.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         2309         1212  python/lib/python3.8/site-packages/yaml/__pycache__/error.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         3983         1344  python/lib/python3.8/site-packages/yaml/__pycache__/events.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         2173          669  python/lib/python3.8/site-packages/yaml/__pycache__/loader.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         1734          728  python/lib/python3.8/site-packages/yaml/__pycache__/nodes.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....        11933         4440  python/lib/python3.8/site-packages/yaml/__pycache__/parser.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         4546         2324  python/lib/python3.8/site-packages/yaml/__pycache__/reader.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....        10091         4117  python/lib/python3.8/site-packages/yaml/__pycache__/representer.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         5487         2589  python/lib/python3.8/site-packages/yaml/__pycache__/resolver.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....        25278         9428  python/lib/python3.8/site-packages/yaml/__pycache__/scanner.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         3329         1670  python/lib/python3.8/site-packages/yaml/__pycache__/serializer.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         4944         1584  python/lib/python3.8/site-packages/yaml/__pycache__/tokens.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         4883         1038  python/lib/python3.8/site-packages/yaml/composer.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....        27187         4445  python/lib/python3.8/site-packages/yaml/constructor.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         3846          513  python/lib/python3.8/site-packages/yaml/cyaml.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         2837          385  python/lib/python3.8/site-packages/yaml/dumper.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....        43006         6558  python/lib/python3.8/site-packages/yaml/emitter.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         2533          718  python/lib/python3.8/site-packages/yaml/error.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         2445          526  python/lib/python3.8/site-packages/yaml/events.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         2061          405  python/lib/python3.8/site-packages/yaml/loader.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         1440          388  python/lib/python3.8/site-packages/yaml/nodes.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....        25495         3678  python/lib/python3.8/site-packages/yaml/parser.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         6794         1832  python/lib/python3.8/site-packages/yaml/reader.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....        14189         2888  python/lib/python3.8/site-packages/yaml/representer.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         8970         2132  python/lib/python3.8/site-packages/yaml/resolver.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....        51277         8869  python/lib/python3.8/site-packages/yaml/scanner.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         4165          900  python/lib/python3.8/site-packages/yaml/serializer.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:36 .....         2573          561  python/lib/python3.8/site-packages/yaml/tokens.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 D....            0            0  python/lib/python3.8/site-packages/zulip
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....        62777        13111  python/lib/python3.8/site-packages/zulip/__init__.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 D....            0            0  python/lib/python3.8/site-packages/zulip/__pycache__
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....        47414        16646  python/lib/python3.8/site-packages/zulip/__pycache__/__init__.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....          983          656  python/lib/python3.8/site-packages/zulip/__pycache__/api_examples.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....         4397         2078  python/lib/python3.8/site-packages/zulip/__pycache__/cli.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....         2750         1595  python/lib/python3.8/site-packages/zulip/__pycache__/send.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....          919          432  python/lib/python3.8/site-packages/zulip/api_examples.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....         4876         1395  python/lib/python3.8/site-packages/zulip/cli.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 D....            0            0  python/lib/python3.8/site-packages/zulip/examples
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....          752          327  python/lib/python3.8/site-packages/zulip/examples/alert-words
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....         1142          483  python/lib/python3.8/site-packages/zulip/examples/create-user
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....          450          254  python/lib/python3.8/site-packages/zulip/examples/delete-message
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....          364          210  python/lib/python3.8/site-packages/zulip/examples/delete-stream
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....          981          456  python/lib/python3.8/site-packages/zulip/examples/edit-message
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....         1334          493  python/lib/python3.8/site-packages/zulip/examples/edit-stream
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....         2037          903  python/lib/python3.8/site-packages/zulip/examples/get-history
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....         1456          508  python/lib/python3.8/site-packages/zulip/examples/get-messages
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....          490          297  python/lib/python3.8/site-packages/zulip/examples/get-public-streams
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....          384          221  python/lib/python3.8/site-packages/zulip/examples/get-raw-message
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....          416          239  python/lib/python3.8/site-packages/zulip/examples/get-stream-topics
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....          450          270  python/lib/python3.8/site-packages/zulip/examples/get-subscriptions
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....          402          238  python/lib/python3.8/site-packages/zulip/examples/get-user-presence
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....          509          311  python/lib/python3.8/site-packages/zulip/examples/list-users
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....          386          220  python/lib/python3.8/site-packages/zulip/examples/message-history
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....          645          333  python/lib/python3.8/site-packages/zulip/examples/mute-topic
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....          832          475  python/lib/python3.8/site-packages/zulip/examples/print-events
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....          641          376  python/lib/python3.8/site-packages/zulip/examples/print-messages
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....          296          185  python/lib/python3.8/site-packages/zulip/examples/realm-emoji
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....          837          366  python/lib/python3.8/site-packages/zulip/examples/send-message
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....          644          353  python/lib/python3.8/site-packages/zulip/examples/subscribe
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....          614          342  python/lib/python3.8/site-packages/zulip/examples/unsubscribe
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....          660          332  python/lib/python3.8/site-packages/zulip/examples/update-message-flags
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....         1025          560  python/lib/python3.8/site-packages/zulip/examples/upload-file
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....         4632         1879  python/lib/python3.8/site-packages/zulip/examples/welcome-message
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....          118          100  python/lib/python3.8/site-packages/zulip/examples/zuliprc
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....            0            0  python/lib/python3.8/site-packages/zulip/py.typed
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:37 .....         3285         1163  python/lib/python3.8/site-packages/zulip/send.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 D....            0            0  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....            4            4  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info/INSTALLER
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....         7143         2904  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info/METADATA
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....        21910         5415  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info/RECORD
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....            0            0  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info/REQUESTED
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....           92           92  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info/WHEEL
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....          191          116  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info/entry_points.txt
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:38 .....           19           19  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info/top_level.txt
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:30 .....          209          143  python/pyvenv.cfg
null_resource.lambda_layer (local-exec): ------------------- ----- ------------ ------------  ------------------------
null_resource.lambda_layer (local-exec): 2024-01-28 21:51:41           58224524     26913347  4270 files, 1194 folders
null_resource.lambda_layer: Creation complete after 26s [id=5409374497015697484]
╷
│ Error: Unable to load "python.zip": open python.zip: no such file or directory
│ 
│   with aws_lambda_layer_version.test_lambda_layer,
│   on main.tf line 185, in resource "aws_lambda_layer_version" "test_lambda_layer":
│  185: resource "aws_lambda_layer_version" "test_lambda_layer" {
│ 
╵
Operation failed: failed running terraform apply (exit 1)

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":144,"Program":"tfcmt","SHA1":"bd23626cfaae96311bdf64788eaa838f508ae901","Vars":{},"WorkflowName":"Deploy cases"} -->